#+TITLE: Un exemple concret d'analyse

#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  fr
#+OPTIONS:   H:3 num:t toc:t \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:nil
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:   
#+LINK_HOME: 
#+XSLT:
#+LaTeX_CLASS: beamer-xetex-fr
#+BEAMER_FRAME_LEVEL: 2
#+BEAMER_HEADER_EXTRA: \usetheme{default}\usecolortheme{default}
#+BEAMER_HEADER_EXTRA: \setbeamertemplate{navigation symbols}{}
#+BEAMER_HEADER_EXTRA: \setbeamercovered{invisible}
#+BEAMER_HEADER_EXTRA: \author{{\large Christophe Pouzat} \\ \vspace{0.2cm} Mathématiques Appliquées à Paris 5 (MAP5) \\ \vspace{0.2cm} Université Paris-Descartes et CNRS UMR 8145 \\ \vspace{0.2cm} \texttt{christophe.pouzat@parisdescartes.fr} }
#+BEAMER_HEADER_EXTRA: \date{Jeudi 26 avril 2012}
#+COLUMNS: %45ITEM %10BEAMER_env(Env) %10BEAMER_envargs(Env Args) %4BEAMER_col(Col) %8BEAMER_extra(Extra)
#+PROPERTY: BEAMER_col_ALL 0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9 1.0 :ETC
#+EPRESENT_FRAME_LEVEL: 2
#+STARTUP: beamer

* Définitions de variables et de fonctions :noexport: 
  
#+name: setup
#+begin_src emacs-lisp :results silent :exports none
  ;; M-: flyspell-generic-check-word-predicate
    (defadvice org-mode-flyspell-verify
      (after my-org-mode-flyspell-verify activate)
      "Don't spell check src blocks."
      (setq ad-return-value
            (and ad-return-value
                 (not (org-in-src-block-p))
                 (not (member 'org-block-begin-line (text-properties-at (point))))
                 (not (member 'org-block-end-line (text-properties-at (point)))))))
  
  (unless (find "beamer-xetex-fr" org-export-latex-classes :key 'car
                :test 'equal)
    (add-to-list 'org-export-latex-classes
                 '("beamer-xetex-fr"
                   "\\documentclass[hyperref={xetex, colorlinks=true, urlcolor=blue, plainpages=false, pdfpagelabels, bookmarksnumbered}]{beamer}
                    \\usepackage{xunicode,fontspec,xltxtra}
                    \\usepackage[french]{babel}
                    \\usepackage{graphicx,longtable,url,rotating}
                    \\definecolor{lightcolor}{gray}{.55}
                    \\definecolor{shadecolor}{gray}{.95}
                    \\usepackage{minted}
                    \\newminted{common-lisp}{fontsize=\\footnotesize}
                    \\setromanfont[Mapping=text-text]{Liberation Serif}
                    \\setsansfont[Mapping=text-text]{Liberation Sans}
                    \\setmonofont[Mapping=text-text]{Liberation Mono}
                    [NO-DEFAULT-PACKAGES]
                    [EXTRA]"
  org-beamer-sectioning)))
  (add-to-list 'org-export-latex-minted-langs
  '(R "r"))  
    (setq org-export-latex-minted-options
          '(("bgcolor" "shadecolor")
            ("fontsize" "\\scriptsize")))
  (setq org-latex-to-pdf-process
        '("xelatex -shell-escape -interaction nonstopmode -output-directory %o %f"
          "xelatex -shell-escape -interaction nonstopmode -output-directory %o %f"
          "xelatex -shell-escape -interaction nonstopmode -output-directory %o %f"))
#+end_src

#+BEGIN_LaTeX 
  % \AtBeginSection[]
  % {
  %   \begin{frame}
  %     \frametitle{Sommaire}
  %     \tableofcontents[currentsection]
  %   \end{frame}
  % }
#+END_LaTeX

#+BEGIN_SRC R :exports none :session *R*
  options(OutDec=",")
#+END_SRC

#+RESULTS:
: 0

#+name: site
: http://www.biomedicale.univ-paris5.fr/physcerv/C_Pouzat/Data_folder/

#+name: adresse-github
: https://raw.github.com/christophe-pouzat/Neuronal-spike-sorting/master/code/sorting.R

#+name: lesNoms
#+BEGIN_SRC R :exports none :cache yes
  paste("Locust_",1:4,".dat.gz",sep="")
#+END_SRC

#+name: nbMesures
: 3e+05


*** =lesNoms=						       :B_alertblock:
    :PROPERTIES:
    :BEAMER_env: alertblock
    :END:

#+name: affecte-lesNoms
#+BEGIN_SRC R :exports code :noweb yes :session *R*
  lesNoms <- <<lesNoms>>
#+END_SRC

#+RESULTS: affecte-lesNoms
| Locust_1.dat.gz |
| Locust_2.dat.gz |
| Locust_3.dat.gz |
| Locust_4.dat.gz |

*** Téléchargement					       :B_alertblock:
    :PROPERTIES:
    :BEAMER_env: alertblock
    :END:
#+name: telechargement
#+BEGIN_SRC R :session *R* :exports code :var site=site 
  sapply(1:4,
         function(i) {
           complet <- paste(site,
                            lesNoms[i],
                            sep="")
           download.file(complet,
                         lesNoms[i],
                         mode="wb")
         })
#+END_SRC

#+RESULTS: telechargement
| 0 |
| 0 |
| 0 |
| 0 |

*** Lecture des données					       :B_alertblock:
    :PROPERTIES:
    :BEAMER_env: alertblock
    :END:
#+name: lD
#+BEGIN_SRC R :session *R* :exports code :noweb yes
  lD <- sapply(lesNoms,
               function(n) {
                 mC <- gzfile(n,open="rb")
                 x <- readBin(mC,what="double",
                              n=<<nbMesures()>>)
                 close(mC)
                 x})
  colnames(lD) <- paste("site",1:4)
#+END_SRC

#+RESULTS: lD
| site 1 |
| site 2 |
| site 3 |
| site 4 |

** Téléchargement du fichier de fonctions (1)
- mes fonctions ne sont pas encore organisées sous forme de paquet =R= ;
- la dernière version de ce fichier peut être téléchargée depuis le dépôt [[https://github.com/][github]] dans le projet =Neuronal-spike-sorting= ;
- mais plutôt que d'effectuer le téléchargement « à  la main », nous allons le faire avec =R= ;
- nous affectons donc à la variable =github= l'=URL= du fichier de fonctions :
#+LaTeX: \tiny
#+name: affection-github
#+BEGIN_SRC R :exports code :cache yes :noweb yes :session *R*
  github <- "<<adresse-github()>>"
#+END_SRC

#+RESULTS[12672ab8c069a85ee3cfeda886c1e93202370941]: affection-github
: https://raw.github.com/christophe-pouzat/Neuronal-spike-sorting/master/code/sorting.R

#+LaTeX: \normalsize

Il manque un « .R » à la fin de l'adresse affichée ci-dessus (c'est hors cadre).

** Téléchargement du fichier de fonctions (2)
- nous allons télécharger le fichier de fonctions dans un fichier que nous nommerons =sorting.R= ;
- nous allons employer la fonction =download.file=, comme pour notre téléchargement de données ;
- il y a ici une petite subtilité due au fait que nous employons une adresse sécurisée ([[http://fr.wikipedia.org/wiki/HTTPS][https]]) ;
- nous allons devoir spécifier « =method= = "wget" » pour effectuer notre tâche ;
- comme le fichier est un fichier texte (contrairement au fichier binaire précédent) nous pouvons garder la valeur par défaut de l'argument =mode= :
#+name: telechargment-de-sorting.R
#+BEGIN_SRC R :session *R* :exports code
  download.file(github,"sorting.R",method="wget")
#+END_SRC

#+RESULTS: telechargment-de-sorting.R
: 0

** Normalisation des événements (2)
- nous souhaitons donc une méthode [[http://en.wikipedia.org/wiki/Robust_statistics][robuste]] d'estimation de l'écart type ;
- la médiane de la valeur absolue des écarts à la médiane ([[http://en.wikipedia.org/wiki/Median_absolute_deviation][Median absolute deviation]]), =MAD= = médiane(|X_i - médiane(X_j)|), fournit ce type d'estimateur : $\hat{\sigma} \approx 1.486 \, \mathrm{MAD}$ ;
- la fonction =mad= de =R= renvoie la valeur cherchée ;
- la =MAD= de chacun des quatre sites est donc simplement obtenue avec :
#+name: lD-MAD
#+BEGIN_SRC R :session *R* :exports both :cache yes
  lD.mad <- apply(lD,2,mad)
  round(lD.mad,digits=2)
#+END_SRC  

#+RESULTS[2c42f7990852031a417da1936c50a294459d57f0]: lD-MAD
| 0.52 |
| 0.63 |
| 0.74 |
| 0.68 |

